{"keras_version": "2.2.4-tf", "config": {"input_layers": [["Input", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 200], "dtype": "int32", "name": "Input", "sparse": false}, "class_name": "InputLayer", "name": "Input", "inbound_nodes": []}, {"config": {"embeddings_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "dtype": "float32", "maxval": 0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "input_length": null, "output_dim": 128, "name": "Embedding", "input_dim": 200000, "batch_input_shape": [null, null], "trainable": true, "embeddings_constraint": null, "dtype": "float32", "activity_regularizer": null}, "class_name": "Embedding", "name": "Embedding", "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"config": {"merge_mode": "concat", "dtype": "float32", "trainable": true, "name": "Bidirectional", "layer": {"config": {"kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "go_backwards": false, "bias_constraint": null, "recurrent_regularizer": null, "unroll": false, "name": "LSTM", "units": 200, "recurrent_dropout": 0.0, "dropout": 0.0, "implementation": 1, "activity_regularizer": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "time_major": false, "zero_output_for_mask": true, "stateful": false, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "use_bias": true, "return_sequences": false, "return_state": false, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "dtype": null, "trainable": true}, "class_name": "LSTM"}}, "class_name": "Bidirectional", "name": "Bidirectional", "inbound_nodes": [[["Embedding", 0, 0, {}]]]}, {"config": {"dtype": "float32", "trainable": true, "rate": 0.5, "seed": null, "name": "Dropout", "noise_shape": null}, "class_name": "Dropout", "name": "Dropout", "inbound_nodes": [[["Bidirectional", 0, 0, {}]]]}, {"config": {"activation": "sigmoid", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "name": "Output", "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "units": 1, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense", "name": "Output", "inbound_nodes": [[["Dropout", 0, 0, {}]]]}], "name": "model", "output_layers": [["Output", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}